In [6]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp311-cp311-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting numpy>=1.23.2 (from pandas)
  Downloading numpy-2.3.5-cp311-cp311-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/miniconda3/envs/mcq_env/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /opt/miniconda3/envs/mcq_env/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp311-cp311-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 8.8 MB/s  0:00:01m0:00:010:01m
Downloading numpy-2.3.5-cp311-cp311-macosx_14_0_arm64.whl (5.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5.4/5.4 MB 4.9 MB/s  0:00:01 eta 0:00:01m
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4/4 [pandas]2m3/4 [pandas]
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [37]:
import pandas as pd

In [38]:
import numpy as np

### Series

In [5]:
data = [1,2,3,4,5]

series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
data1 = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data1)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
data2 = [10,20,30]

index1 = ['a','b','c']

series_custom = pd.Series(data2, index=index1)

print(series_custom)

a    10
b    20
c    30
dtype: int64

### DataFrame

In [97]:
data = {
    'name': ['krish','kevin','jack'],
    'age': [25, 30, 45],
    'city':['bangalore','new york','florida']
}

df = pd.DataFrame(data)
print(df)

    name  age       city
0  krish   25  bangalore
1  kevin   30   new york
2   jack   45    florida

In [98]:
data = [
    {"name":"Thameem",'age':20,'place':'India'},
    {"name":"kevin",'age':25,'place':'Uk'},
    {"name":"anvar",'age':30,'place':'India'},
    {"name":"peter",'age':18,'place':'Spain'}
]

dt = pd.DataFrame(data)
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

## Reading Data from CSV file

In [22]:
df = pd.read_csv("sales_data.csv")
print(df.head())

                              Region                Country        Item Type  \
0              Australia and Oceania                 Tuvalu        Baby Food
1  Central America and the Caribbean                Grenada           Cereal
2                             Europe                 Russia  Office Supplies
3                 Sub-Saharan Africa  Sao Tome and Principe           Fruits
4                 Sub-Saharan Africa                 Rwanda  Office Supplies

  Sales Channel Order Priority Order Date   Order ID  Ship Date  Units Sold  \
0       Offline              H  5/28/2010  669165933  6/27/2010        9925
1        Online              C  8/22/2012  963881480  9/15/2012        2804
2       Offline              L   5/2/2014  341417157   5/8/2014        1779
3        Online              C  6/20/2014  514321792   7/5/2014        8102
4       Offline              L   2/1/2013  115456712   2/6/2013        5062

   Unit Price  Unit Cost  Total Revenue  Total Cost  Total Profit
0      255.28     159.42     2533654.00  1582243.50     951410.50
1      205.70     117.11      576782.80   328376.44     248406.36
2      651.21     524.96     1158502.59   933903.84     224598.75
3        9.33       6.92       75591.66    56065.84      19525.82
4      651.21     524.96     3296425.02  2657347.52     639077.50

## Accessing Data in DataFrame

In [25]:
df['Region']

0                 Australia and Oceania
1     Central America and the Caribbean
2                                Europe
3                    Sub-Saharan Africa
4                    Sub-Saharan Africa
                    ...
95                   Sub-Saharan Africa
96                                 Asia
97                   Sub-Saharan Africa
98                        North America
99                   Sub-Saharan Africa
Name: Region, Length: 100, dtype: object

In [28]:
df.loc[0]

Region            Australia and Oceania
Country                          Tuvalu
Item Type                     Baby Food
Sales Channel                   Offline
Order Priority                        H
Order Date                    5/28/2010
Order ID                      669165933
Ship Date                     6/27/2010
Units Sold                         9925
Unit Price                       255.28
Unit Cost                        159.42
Total Revenue                 2533654.0
Total Cost                    1582243.5
Total Profit                   951410.5
Name: 0, dtype: object

In [33]:
df.loc[1]

Region            Central America and the Caribbean
Country                                     Grenada
Item Type                                    Cereal
Sales Channel                                Online
Order Priority                                    C
Order Date                                8/22/2012
Order ID                                  963881480
Ship Date                                 9/15/2012
Units Sold                                     2804
Unit Price                                    205.7
Unit Cost                                    117.11
Total Revenue                              576782.8
Total Cost                                328376.44
Total Profit                              248406.36
Name: 1, dtype: object

In [40]:
df.iloc[0,0]

'Australia and Oceania'

In [42]:
df.iloc[1,2]

'Cereal'

In [47]:
df.at[1, 'Region']

'Central America and the Caribbean'

In [49]:
df.at[2, 'Item Type']

'Office Supplies'

In [51]:
df.iat[2, 2]

'Office Supplies'

In [52]:
df.iat[2, 3]

'Offline'

## Data Manipulatio with DataFrame

In [56]:
df['Unit Price']

0     255.28
1     205.70
2     651.21
3       9.33
4     651.21
       ...
95    109.28
96      9.33
97    154.06
98     81.73
99    668.27
Name: Unit Price, Length: 100, dtype: float64

In [99]:
dt

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

In [100]:
dt['projects'] = [58, 77, 22, 14]

print(dt)

      name  age  place  projects
0  Thameem   20  India        58
1    kevin   25     Uk        77
2    anvar   30  India        22
3    peter   18  Spain        14

In [101]:
dt.drop('projects', axis=1, inplace=True)
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

In [102]:
dt['age'] = dt['age'] + 1
dt

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India
3    peter   19  Spain

In [103]:
dt.drop(3, inplace=True)
print(dt)

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India

## DataFrame attributes and methods

In [ ]:
print(dt.head())
print(dt.dtypes)
print(dt.describe())

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India
name     object
age       int64
place    object
dtype: object
        age
count   3.0
mean   26.0
std     5.0
min    21.0
25%    23.5
50%    26.0
75%    28.5
max    31.0

# Sample Data

In [5]:
df = pd.DataFrame({
    'Student_ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Name': ['Emma', 'Liam', 'Olivia', 'Noah', 'Ava', 'Mia', 'Ethan', 'Sophia', 'James', 'Isabella'],
    'Gender': ['F', 'M', 'F', 'M', 'F', 'F', 'M', 'F', 'M', 'F'],
    'Branch': ['CSE', 'CSE', 'ECE', 'ECE', 'ME', 'CSE', 'ME', 'ECE', 'CSE', 'CSE'],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Chennai', 'Hyderabad', 'Pune', 'Bangalore', 'Delhi', 'Chennai'],
    'Score': [88, 76, 92, 65, 70, 95, 58, 81, 73, 90],
    'Attendance (%)': [90, 85, 80, 75, 88, 70, 60, 92, 89, 78],
    'Skill Rating (1-10)': [9, 7, 8, 5, 6, 10, 4, 9, 7, 8],
    'Projects Completed': [12, 8, 10, 5, 7, 15, 3, 11, 9, 13],
    'Email': [
        'emma@gmail.com', 'liam@gmail.com', 'olivia@yahoo.com', 'noah@outlook.com', 
        'ava@gmail.com', 'mia@gmail.com', 'ethan@yahoo.com', 'sophia@gmail.com',
        'james@outlook.com', 'isabella@gmail.com'
    ]
})

In [6]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance (%),Skill Rating (1-10),Projects Completed,Email
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com
1,102,Liam,M,CSE,Mumbai,76,85,7,8,liam@gmail.com
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com

### Updating & Replacing

In [14]:
# updating single cell
df.loc[1] # students Liam
df.loc[1, 'City'] = 'Pune'
af = df.rename(columns={'Attendance (%)':'Attendance'})
af

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email
0,101,Emma,F,CSE,Delhi,88,90,9,12,emma@gmail.com
1,102,Liam,M,CSE,Pune,76,85,7,8,liam@gmail.com
2,103,Olivia,F,ECE,Delhi,92,80,8,10,olivia@yahoo.com
3,104,Noah,M,ECE,Pune,65,75,5,5,noah@outlook.com
4,105,Ava,F,ME,Chennai,70,88,6,7,ava@gmail.com
5,106,Mia,F,CSE,Hyderabad,95,70,10,15,mia@gmail.com
6,107,Ethan,M,ME,Pune,58,60,4,3,ethan@yahoo.com
7,108,Sophia,F,ECE,Bangalore,81,92,9,11,sophia@gmail.com
8,109,James,M,CSE,Delhi,73,89,7,9,james@outlook.com
9,110,Isabella,F,CSE,Chennai,90,78,8,13,isabella@gmail.com

In [27]:
# using iloc
df.iloc[3, 3]='CSE' # changed branch of student Noah with index 3 from ECE to CSE
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,90,90,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,78,85,7,8,liam@gmail.com,Pass
2,103,Olivia,F,ECE,Delhi,94,80,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,67,75,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,72,88,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,97,70,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,60,60,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,83,92,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,75,89,7,9,james@outlook.com,Pass
9,110,Isabella,F,CSE,Chennai,92,78,8,13,isabella@gmail.com,Pass

In [28]:
# Updating Multiple Column at once
df['Score'] = df['Score'] + 1
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,91,90,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79,85,7,8,liam@gmail.com,Pass
2,103,Olivia,F,ECE,Delhi,95,80,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,68,75,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73,88,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98,70,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61,60,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,84,92,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,76,89,7,9,james@outlook.com,Pass
9,110,Isabella,F,CSE,Chennai,93,78,8,13,isabella@gmail.com,Pass

In [33]:
# Add a column based on another column

df['Result'] = df['Score'].apply(lambda x: 'Pass' if x>= 70 else 'Fail')  
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,91,90,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79,85,7,8,liam@gmail.com,Pass
2,103,Olivia,F,ECE,Delhi,95,80,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,68,75,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73,88,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98,70,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61,60,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,84,92,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,76,89,7,9,james@outlook.com,Pass

### Deleting & Cleaning & Null Handling

In [ ]:
# Deleting a specific content
df = df.drop(9, axis=0)

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,91,90,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79,85,7,8,liam@gmail.com,Pass
2,103,Olivia,F,ECE,Delhi,95,80,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,68,75,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73,88,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98,70,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61,60,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,84,92,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,76,89,7,9,james@outlook.com,Pass

In [45]:
df.loc[df['Name'] =='Emma', 'Score'] = np.nan
df.loc[df['Student_ID'] ==108, 'Attendance'] = np.nan
df.loc[df['Student_ID'] ==103, 'Branch'] = np.nan

In [47]:
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,NaN,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
2,103,Olivia,F,NaN,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass

In [53]:
# Filling NaN Values with zero clean the data
df['Score'] =df['Score'].fillna(0)
df['Score']

df.loc[df['Student_ID']==103,'Branch']='ME'
df

,Student_ID,Name,Gender,Branch,City,Score,Attendance,Skill Rating (1-10),Projects Completed,Email,Result
0,101,Emma,F,CSE,Delhi,0.0,90.0,9,12,emma@gmail.com,Pass
1,102,Liam,M,CSE,Pune,79.0,85.0,7,8,liam@gmail.com,Pass
2,103,Olivia,F,ME,Delhi,95.0,80.0,8,10,olivia@yahoo.com,Pass
3,104,Noah,M,CSE,Pune,68.0,75.0,5,5,noah@outlook.com,Fail
4,105,Ava,F,ME,Chennai,73.0,88.0,6,7,ava@gmail.com,Pass
5,106,Mia,F,CSE,Hyderabad,98.0,70.0,10,15,mia@gmail.com,Pass
6,107,Ethan,M,ME,Pune,61.0,60.0,4,3,ethan@yahoo.com,Fail
7,108,Sophia,F,ECE,Bangalore,84.0,NaN,9,11,sophia@gmail.com,Pass
8,109,James,M,CSE,Delhi,76.0,89.0,7,9,james@outlook.com,Pass

### Sorting & Filtering

### Grouping & Aggregate

### concatenation & combining dataframes